
## Plan Result (prod_twingate)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 2 to change, 3 to destroy.</code></pre>

* Create
  * time_rotating.service_account_key_rotation
* Update
  * azurerm_key_vault_secret.service_account_key[&#34;AzureDevOps&#34;]
  * azurerm_key_vault_secret.service_account_key[&#34;Pterodactyl&#34;]
* Replace
  * time_static.service_account_key_rotation


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.service_account_key["AzureDevOps"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "service_account_key" {
      ~ expiration_date         = "2025-03-13T15:42:30Z" -> (known after apply)
        id                      = "https://bancey-vault.vault.azure.net/secrets/Twingate-AzureDevOps-SA-Key/fd732bb1f6034800b3ccff2092c60396"
        name                    = "Twingate-AzureDevOps-SA-Key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.service_account_key["Pterodactyl"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "service_account_key" {
      ~ expiration_date         = "2025-03-13T15:42:30Z" -> (known after apply)
        id                      = "https://bancey-vault.vault.azure.net/secrets/Twingate-Pterodactyl-SA-Key/88e9c6b2d49b46068a92ffaf0dac9120"
        name                    = "Twingate-Pterodactyl-SA-Key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # time_rotating.service_account_key_rotation will be created
  + resource "time_rotating" "service_account_key_rotation" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 7
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # time_static.service_account_key_rotation must be replaced
-/+ resource "time_static" "service_account_key_rotation" {
      ~ day     = 13 -> (known after apply)
      ~ hour    = 15 -> (known after apply)
      ~ id      = "2025-03-13T15:42:30Z" -> (known after apply)
      ~ minute  = 42 -> (known after apply)
      ~ month   = 3 -> (known after apply)
      ~ rfc3339 = "2025-03-13T15:42:30Z" -> (known after apply) # forces replacement
      ~ second  = 30 -> (known after apply)
      ~ unix    = 1741880550 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # twingate_service_account_key.this["AzureDevOps"] will be replaced due to changes in replace_triggered_by
-/+ resource "twingate_service_account_key" "this" {
      ~ id                 = "U2VydmljZUFjY291bnRLZXk6SV9RdUhKVG9OWElTb3V1SEhIc3BSSXFlcDhHYmZJS0V1NlRXVl9UTkxFbw==" -> (known after apply)
      ~ is_active          = true -> (known after apply)
        name               = "AzureDevOps Key (auto rotates)"
      ~ token              = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # twingate_service_account_key.this["Pterodactyl"] will be replaced due to changes in replace_triggered_by
-/+ resource "twingate_service_account_key" "this" {
      ~ id                 = "U2VydmljZUFjY291bnRLZXk6emJwVEJTZjRPTVpaR1dGTk9PMUlzdHQwVUFYYVRzSm9YWEU3MldPOGhjUQ==" -> (known after apply)
      ~ is_active          = true -> (known after apply)
        name               = "Pterodactyl Key (auto rotates)"
      ~ token              = (sensitive value)
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 3 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # time_rotating.service_account_key_rotation has been deleted
  - resource "time_rotating" "service_account_key_rotation" {
        id               = "2025-03-13T15:42:30Z"
      - rfc3339          = "2025-03-13T15:42:30Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":509,"Program":"tfcmt","SHA1":"","Target":"prod_twingate","Vars":{}} -->